# IsEmpty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArray..::..IsEmpty Property
ExternalApplicationArray Class See Also
---
Test to see if the array is empty.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool IsEmpty { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property IsEmpty As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool IsEmpty {
	bool get ();
}
```

# Remarks
If the array is empty then True will be returned, otherwise False.
# See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace